{
  "fullName": "Michael (Mehdi) Solati",
  "title": "Cirrus, alto cumulus, cirrostratus. Yea, I speak cloud. No biggie.",
  "location": "San Francisco Bay Area",
  "description": "I am obsessed with two things: coffee and the web. Luckily being in Developer Relations, I get my fill of both every single day- whether through building new applications, working on tools for developers, or sharing my experiences across the world!No amount of time is ever enough to do everything I want. So I have to stay moving by writing guides, building cool apps, teaching fledgling developers the voodoo magic of the web and most importantly Drinking coffee...",
  "experience": [
    {
      "title": "Developer Program Engineer",
      "company": "Google",
      "location": "San Francisco Bay Area",
      "start": "2019-11-01T07:00:00.000Z",
      "end": null,
      "current": true,
      "description": ""
    },
    {
      "title": "Developer Advocate",
      "company": "Typeform.com",
      "location": "San Francisco, CA",
      "start": "2019-01-01T08:00:00.000Z",
      "end": "2019-10-01T07:00:00.000Z",
      "current": false,
      "description": "Promote the adoption of Typeform while collecting constructive feedback to make the platform better. Built tools for developers to easily use Typeform services and APIs while also building examples and writing guides of how to use Typeform. Explored and developed integrations with other platforms."
    },
    {
      "title": "Front End Engineer",
      "company": "Sellpoints, Inc.",
      "location": "Emeryville, CA",
      "start": "2018-05-01T07:00:00.000Z",
      "end": "2019-01-01T08:00:00.000Z",
      "current": false,
      "description": "Revamped UI, UX and interface for client-facing retargeting platform as well as maintained other e-Commerce marketing platforms. Implemented modern web development techniques, such as custom elements, into older frameworks and software in order to migrate them into new best practices."
    },
    {
      "title": "Company Name Checkmate.Digital",
      "company": "",
      "location": "New Haven, CT",
      "start": "2016-02-01T08:00:00.000Z",
      "end": "2018-05-01T07:00:00.000Z",
      "current": false,
      "description": "Lead development tasks within a fullstack scope such as creating REST API components, developing native applications for consumption of APIs, and cultivating user-friendly training programs. Provide continuous improvement of open source projects. Aggressively source and hire the majority of development staff including the current CTO."
    },
    {
      "title": "Lead Developer",
      "company": "Kricket App",
      "location": "New Haven, CT",
      "start": "2017-01-01T08:00:00.000Z",
      "end": "2017-11-01T07:00:00.000Z",
      "current": false,
      "description": "Collaboratively developed complete rework of the Kricket application which included creation of a database relational model, REST API endpoints, and native mobile applications. Networked with clients to design custom solutions for integration of geodata. Presented at multiple conferences on processes and methodologies of utilizing client side geodata."
    }
  ],
  "education": [
    {
      "school": "Southern Connecticut State University",
      "degree": "Bachelor of Science (B.S.)",
      "field": "Computer Science",
      "start": "2012-01-01T00:00:00.000Z",
      "end": "2018-01-01T00:00:00.000Z"
    }
  ]
}
